cool-react-things.org
#+TITLE: React Paradigms in Practice
#+AUTHOR: Kyle
#+EMAIL: kyle@codesignal.com
#+LANGUAGE: en
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc H:4 num:nil
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:https://orgmode.org/org-info.js
#+SETUPFILE: theme-readtheorg.setup
#+EXPORT_FILE_NAME: index.html

#+BEGIN_COMMENT
Trying to find ways to add styling here. it's a bit tricky
Potential leads: [[https://github.com/fniessen/org-html-themes#readtheorg][readtheorg]]
also have older bootstrap2 base site, [[http://renard.github.io/o-blog/index.html][oblog]]

reference card for org mode [[https://github.com/fniessen/refcard-org-mode][refcard]]

[[https://codersblock.com/blog/customizing-github-gists/][styling github gists]]
[[https://lonekorean.github.io/gist-syntax-themes/][direct link to gist-syntax-themes]]

Html elements can be embedded inside of a #+BEGIN_EXPORT html and #+END_EXPORT block

specific ids for css targetting can be applied to sections with the following blocks:

//- Some Section Header
//- :PROPERTIES:
//- :CUSTOM_ID: customIdForCss
//- :END:

#+END_COMMENT

* React Components
** Paradigms 
*** Introduction and Overview
    Here's a quick video discussion about the major patterns of React components that we'll be exploring.
#+BEGIN_EXPORT html
<div class="container-fluid">
  <div class="row">
    <div class="col-12 col-md-offset-1 col-md-10 col-lg-offset-2 col-lg-8">
      <div class="embed-responsive embed-responsive-16by9">
        <iframe class="embed-responsive-item" src="https://www.youtube.com/embed/YaZg8wg39QQ?rel=0" frameborder="0" allow="autoplay; encrypted-media" allowfullscreen></iframe>
      </div>
    </div>
  </div>
</div>
#+END_EXPORT
*** Functional Component (Pure Component)
**** No state, no side effects, just rendering. Choose your favorite flavor.


#+NAME: Functional Component Example
#+BEGIN_SRC js -n :exports (when (eq org-export-current-backend 'html) "none")
import React from 'react';
const Box = ({color}) => (
  <div
    style={{
      backgroundColor: color || 'green',
      height: '10px',
      width: '10px'
    }}
  />
);
#+END_SRC

#+NAME: PureComponent Example
#+BEGIN_SRC js -n :exports (when (eq org-export-current-backend 'html) "none")
import * as React from 'react';

class Box extends React.PureComponent {
  render() {
    return (
      <div
        style={{
          backgroundColor: color || 'green',
          height: '10px',
          width: '10px'
        }}
      />
    );
  }
}
#+END_SRC

#+BEGIN_EXPORT html
<script src="https://gist.github.com/ksaxberg/5653ba87024fd37b3a0d8785b10b7194.js"></script>
#+END_EXPORT

#+BEGIN_EXPORT html
<script src="https://gist.github.com/ksaxberg/ef1d0598b609a3f60a690eb3b5061402.js"></script>
#+END_EXPORT

**** What is ~PureComponent~?
A React Component's ~shouldComponentUpdate~ method is defaulted to ~return true~, as this method exists to give the developer a means of improving component performance on a case by case basis. PureComponent has this defaulted
to a shallow comparison of props and state, which is largely what you would want in a component that acts like a function (same input, same output). Using Pure Component can improve performance by preventing unnecessary rendering of react components.

**** Still some discussion about usage
There are some [[https://hackernoon.com/react-stateless-functional-components-nine-wins-you-might-have-overlooked-997b0d933][benefits]] and [[https://medium.freecodecamp.org/7-reasons-to-outlaw-reacts-functional-components-ff5b5ae09b7c][drawbacks]]

Quick summary about Functional Components:
- Easy to test
- Easy to read
- Provide no efficiency under the hood, React still creates the class that you didn't
- Conversions to PureComponent (the efficient version) look noisy in Diff viewers as you have to add class boilerplate
- The React Team has plans to make Functional Components implement PureComponent by default.

**** Additional Resources
- [[https://reactjs.org/docs/react-api.html#reactpurecomponent][Pure Component]] in the React Documentation
- [[https://www.youtube.com/watch?v=Lx0AE-mhNlg][Quick tutorial about functional components]]
- [[https://www.youtube.com/watch?v=40Bq8kOKB74][A quick comparison of shouldComponentUpdate and PureComponent]]

**** A note on Presentational Components (Spoiler alert: It's just a View)
[[https://medium.com/@dan_abramov/smart-and-dumb-components-7ca2f9a7c7d0][Dan Abramov]] strongly suggests separating Functional (Presentational) Components and Controller components. 
The distinction is usually drawn along the lines of [[https://medium.com/@yassimortensen/container-vs-presentational-components-in-react-8eea956e1cea][presentational components organizing the view]], 
while the container component may load or organize data. So if you use Functional Components as views in
MVC, you're in good form!

Sometimes you have complex structures that would be served well by having a layout view component. This would
look something like the following:

#+BEGIN_SRC js -n :exports (when (eq org-export-current-backend 'html) "none")
const MainDisplay = ({header, sidebar, leftColumn, rightColumn}) => (
  <div className="app">
    <div className="header">
      {header}
    </div>
    <div className="sidebar">
      {sidebar}
    </div>
    <div className="main-content">
      <div className="leftColumn">
        {leftColumn}
      </div>
      <div className="rightColumn">
        {rightColumn}
      </div>
    </div>
  </div>
);
#+END_SRC

#+BEGIN_EXPORT html
<script src="https://gist.github.com/ksaxberg/3e6acbd907fb10349487b96fca278314.js"></script>
#+END_EXPORT


*** Controller Component
**** Can have state, bind functions, organize layouts
