index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-21 Tue 19:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>React Paradigms in Practice</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Kyle" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
<link href="https://stackpath.bootstrapcdn.com/bootstrap/3.3.4/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-604wwakM23pEysLJAhja8Lm42IIwYrJ0dEAqzFsj9pJ/P5buiujjywArgPCi8eoz" crossorigin="anonymous">
<link rel="stylesheet" type="text/css" href="firacodefont.css" />
<link rel="stylesheet" type="text/css" href="orgmodestylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">React Paradigms in Practice</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1d4b119">React Components</a>
<ul>
<li><a href="#orgf5114a3">Paradigms</a>
<ul>
<li><a href="#orgd7611e0">Introduction and Overview</a></li>
<li><a href="#org5a0083b">Functional Component (Pure Component)</a>
<ul>
<li><a href="#org518a318">No state, no side effects, just rendering. Choose your favorite flavor.</a></li>
<li><a href="#orgfdb4c9e">What is <code>PureComponent</code>?</a></li>
<li><a href="#orga760c50">Still some discussion about usage</a></li>
<li><a href="#org74690a2">Additional Resources</a></li>
<li><a href="#org86bb81b">A note on Presentational Components (Spoiler alert: It's just a View)</a></li>
</ul>
</li>
<li><a href="#org0bc804a">Controller Component</a>
<ul>
<li><a href="#org1f1ff47">Can have state, bind functions, organize layouts</a></li>
<li><a href="#orgc3a67f0">It loads data. It might send it to view components. It hooks into the lifecycle methods to get the job done</a></li>
</ul>
</li>
<li><a href="#org131bcc5">Higher Order Component</a>
<ul>
<li><a href="#orgf3165bb">Provides additional functionality to the component(s) that are wrapped</a></li>
<li><a href="#org51e5f38">Structure: <code>const HoC = config =&gt; BaseComponent =&gt; EnhancedComponent</code></a></li>
<li><a href="#org1109e77">Separating logic from containers can help improve your code</a></li>
<li><a href="#org7ad963e">The React team has certain suggestions about how to implement HoCs</a></li>
<li><a href="#org5ef1bbb">Additional Resources</a></li>
</ul>
</li>
<li><a href="#org0009e10">Render Props</a>
<ul>
<li><a href="#orgb07f02c">Share functionality between components</a></li>
<li><a href="#org7f769ea">What exactly do Render Props do for you?</a></li>
<li><a href="#org2d8e4fd">Some things to note</a></li>
<li><a href="#orged55e4b">Additional Resources</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org738fa61">How Can We Leverage These?</a>
<ul>
<li><a href="#org660da46">Let's check out some useful pre-made Render Props from React-Powerplug</a>
<ul>
<li><a href="#orgd54aae8">Hover</a></li>
<li><a href="#orgaca1666">Value</a></li>
<li><a href="#org2bd21e0">List</a></li>
<li><a href="#org4db0554">State</a></li>
</ul>
</li>
<li><a href="#org9da4d78">Use Case: Using an Accordion</a></li>
<li><a href="#orgdeeaa8a">Data Loading</a>
<ul>
<li><a href="#org7578e9e">Wouldn't it be nice if there were some sort of <code>Loader</code> component?</a></li>
<li><a href="#orge11b685">Let's look at an HoC implementation of Loader first</a></li>
<li><a href="#orga0028d4">And here's a  Render Props version of Loader</a></li>
</ul>
</li>
<li><a href="#org205b004">Package to help get ideas about how to use Render Props</a>
<ul>
<li><a href="#org7a5f314">React-Powerplug</a></li>
<li><a href="#org5418cae">List of Render Props Packages</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6e45c13">Flexible Layouts with Context API and Render Props</a>
<ul>
<li>
<ul>
<li><a href="#org54ada66">How should component data flow be organized to allow flexibility with Render Props or with Context API</a></li>
<li><a href="#org76ecaf8">Wouldn't it be nice to have this kind of flexibility?</a></li>
<li><a href="#org9d7f126">Let's see how we can create this kind of component utilizing React's context API to allow us to skip directly passing props.</a></li>
<li><a href="#org4806410">Word of caution</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1d4b119" class="outline-2">
<h2 id="org1d4b119">React Components</h2>
<div class="outline-text-2" id="text-org1d4b119">
</div>
<div id="outline-container-orgf5114a3" class="outline-3">
<h3 id="orgf5114a3">Paradigms</h3>
<div class="outline-text-3" id="text-orgf5114a3">
</div>
<div id="outline-container-orgd7611e0" class="outline-4">
<h4 id="orgd7611e0">Introduction and Overview</h4>
<div class="outline-text-4" id="text-orgd7611e0">
<p>
Here's a quick video discussion about the major patterns of React components that we'll be exploring.
</p>
<div class="container-fluid">
  <div class="row">
    <div class="col-12 col-md-offset-1 col-md-10 col-lg-offset-2 col-lg-8">
      <div class="embed-responsive embed-responsive-16by9">
        <iframe class="embed-responsive-item" src="https://www.youtube.com/embed/YaZg8wg39QQ?rel=0" frameborder="0" allow="autoplay; encrypted-media" allowfullscreen></iframe>
      </div>
    </div>
  </div>
</div>
</div>
</div>
<div id="outline-container-org5a0083b" class="outline-4">
<h4 id="org5a0083b">Functional Component (Pure Component)</h4>
<div class="outline-text-4" id="text-org5a0083b">
</div>
<div id="outline-container-org518a318" class="outline-5">
<h5 id="org518a318">No state, no side effects, just rendering. Choose your favorite flavor.</h5>
<div class="outline-text-5" id="text-org518a318">
<script src="https://gist.github.com/ksaxberg/5653ba87024fd37b3a0d8785b10b7194.js"></script>

<script src="https://gist.github.com/ksaxberg/ef1d0598b609a3f60a690eb3b5061402.js"></script>
</div>
</div>

<div id="outline-container-orgfdb4c9e" class="outline-5">
<h5 id="orgfdb4c9e">What is <code>PureComponent</code>?</h5>
<div class="outline-text-5" id="text-orgfdb4c9e">
<p>
A React Component's <code>shouldComponentUpdate</code> method is defaulted to <code>return true</code>, as this method exists to give the developer a means of improving component performance on a case by case basis. PureComponent has this defaulted
to a shallow comparison of props and state, which is largely what you would want in a component that acts like a function (same input, same output). Using Pure Component can improve performance by preventing unnecessary rendering of react components.
</p>
</div>
</div>

<div id="outline-container-orga760c50" class="outline-5">
<h5 id="orga760c50">Still some discussion about usage</h5>
<div class="outline-text-5" id="text-orga760c50">
<p>
There are some <a href="https://hackernoon.com/react-stateless-functional-components-nine-wins-you-might-have-overlooked-997b0d933">benefits</a> and <a href="https://medium.freecodecamp.org/7-reasons-to-outlaw-reacts-functional-components-ff5b5ae09b7c">drawbacks</a>
</p>

<p>
Quick summary about Functional Components:
</p>
<ul class="org-ul">
<li>Easy to test</li>
<li>Easy to read</li>
<li>Provide no efficiency under the hood, React still creates the class that you didn't</li>
<li>Conversions to PureComponent (the efficient version) look noisy in Diff viewers as you have to add class boilerplate</li>
<li>The React Team has plans to make Functional Components implement PureComponent by default.</li>
</ul>
</div>
</div>

<div id="outline-container-org74690a2" class="outline-5">
<h5 id="org74690a2">Additional Resources</h5>
<div class="outline-text-5" id="text-org74690a2">
<ul class="org-ul">
<li><a href="https://reactjs.org/docs/react-api.html#reactpurecomponent">Pure Component</a> in the React Documentation</li>
<li><a href="https://www.youtube.com/watch?v=Lx0AE-mhNlg">Quick tutorial about functional components</a></li>
<li><a href="https://www.youtube.com/watch?v=40Bq8kOKB74">A quick comparison of shouldComponentUpdate and PureComponent</a></li>
</ul>
</div>
</div>

<div id="outline-container-org86bb81b" class="outline-5">
<h5 id="org86bb81b">A note on Presentational Components (Spoiler alert: It's just a View)</h5>
<div class="outline-text-5" id="text-org86bb81b">
<p>
<a href="https://medium.com/@dan_abramov/smart-and-dumb-components-7ca2f9a7c7d0">Dan Abramov</a> strongly suggests separating Functional (Presentational) Components and Controller components. 
The distinction is usually drawn along the lines of <a href="https://medium.com/@yassimortensen/container-vs-presentational-components-in-react-8eea956e1cea">presentational components organizing the view</a>, 
while the container component may load or organize data. So if you use Functional Components as views in
MVC, you're in good form!
</p>

<p>
Sometimes you have complex structures that would be served well by having a layout view component. This would
look something like the following:
</p>

<script src="https://gist.github.com/ksaxberg/3e6acbd907fb10349487b96fca278314.js"></script>
</div>
</div>
</div>


<div id="outline-container-org0bc804a" class="outline-4">
<h4 id="org0bc804a">Controller Component</h4>
<div class="outline-text-4" id="text-org0bc804a">
</div>
<div id="outline-container-org1f1ff47" class="outline-5">
<h5 id="org1f1ff47">Can have state, bind functions, organize layouts</h5>
</div>
