cool-react-things.org
**** It loads data. It might send it to view components. It hooks into the lifecycle methods to get the job done
     
 #+BEGIN_SRC js -n :exports (when (eq org-export-current-backend 'html) "none")
 import * as React from 'react';

 class ColorBox extends React.Component {
   componentDidMount() {
     this.getColors();
   }

   getColors = async () => {
     const colors = await axios.get('https://color.api/random');
     this.setState({colors});
   }

   render() {
     return (
       <div>
         {this.state.colors.forEach(color => (<Box key={color} color={color} />))}
         <button type="button" onClick={this.getColors}>New Colors</button>
       </div>
     );
   }
 }

 #+END_SRC

#+BEGIN_EXPORT html
<script src="https://gist.github.com/ksaxberg/f8f73aaafa003c6991355e8a5eb59ee2.js"></script>
#+END_EXPORT

*** Higher Order Component
**** Provides additional functionality to the component(s) that are wrapped
**** Structure: ~const HoC = config => BaseComponent => EnhancedComponent~
#+BEGIN_SRC js -n :exports (when (eq org-export-current-backend 'html) "none")
// connect: The HoC we know and love
import { connect } from 'react-redux';

const AwareComponent = connect(getCurrentUser)(Component);

// Making a new Higher Order Component that binds some props

// This function takes a component...
function propBinder(WrappedComponent, propsToBind) {
  // ...and returns another component...
  return class extends React.Component {
    render() {
      // Notice that we pass through any additional props
      return <WrappedComponent {...this.props} {...propsToBind} />;
    }
  };
}

const AlertButton = propBinder(Button, {
  type: 'alert',
  size: '24',
  case: 'none',
  fontSize: '14',
  className: '-margin-h-8'
});


// A version using lambdas
const propBinder2 = propsToBind => WrappedComponent =>
  (props) => <WrappedComponent {...props} {...propsToBind} />;

const AlertButton2 = propBinder2({
  type: 'alert',
  size: '24',
  case: 'none',
  fontSize: '14',
  className: '-margin-h-8'
})(Button);
#+END_SRC

#+BEGIN_EXPORT html
<script src="https://gist.github.com/ksaxberg/9094c3004bf5d619ca0f1d75440d5e9c.js"></script>
#+END_EXPORT

**** Separating logic from containers can help improve your code
- Containers can worry less about its data loading, management, or connecting to application state management when that functionality is added via an HoC.
- Enables you to share functionality between components, as the HoCs exist independent of the components they are applied to.
- Can make using components more difficult, as you need to look at the ~connect~ function to see what props are being passed by Redux and what props are required to be given to the component.
- Adds some visual complexity, as now your app has logic being added to compoennts by a function call, which doesn't look very "jsx"-y. You need to hunt down bugs tracking both through layers of JSX and layers of HoCs.

**** The React team has certain suggestions about how to implement HoCs 
- Don't [[https://reactjs.org/docs/higher-order-components.html#dont-mutate-the-original-component-use-composition][modify the functions of the wrapped component]]
- HoCs should support [[https://reactjs.org/docs/higher-order-components.html#convention-pass-unrelated-props-through-to-the-wrapped-component][passthrough of unrelated props]]
- Use the [[https://reactjs.org/docs/higher-order-components.html#convention-maximizing-composability][HoC thunk pattern to support composition]] , which just means you have the parenthesis ~connect(config)(Component)~ instead of ~connect(config, Component)~
  - This allows for clear distinction of the component and argmuments when applying multiple HoCs

**** Additional Resources
- [[https://reactjs.org/docs/higher-order-components.html][Higher Order Components]] in the React Documentation
- An [[https://www.robinwieruch.de/gentle-introduction-higher-order-components/][introduction to HoCs]]
- A tutorial on HoCs [[https://levelup.gitconnected.com/understanding-react-higher-order-components-by-example-95e8c47c8006][by example]]
- The self-purported [[https://medium.freecodecamp.org/higher-order-components-the-ultimate-guide-b453a68bb851][Ultimate Guide to HoCs]]

*** Render Props
**** Share functionality between components
Here we have a Toggle Render Prop which allows us to share the state of 'on' and a functin to modify that state. Anywhere we need that functionality we can use this Toggle, meaning that we can re-use this state logic!

#+BEGIN_SRC js -n :exports (when (eq org-export-current-backend 'html) "none")
const Button = () => (
  <Toggle>
    {({on, toggle}) => (
      <button type="button" onClick={toggle}>
        Turn {on ? 'Off' : 'On'}
      </button>
    )}
  </Toggle>
);

// Defining a Toggle Render Prop

type RenderPropArgs = {
  on: boolean,
  toggle: () => *
};

type Props = { children: React.ComponentType<RenderPropArgs> };
type State = { on: boolean };

class Toggle extends React.Component<Props, State> {
  state = {
    on: false
  };

  toggle = () => this.setState(({on}) => ({on: !on}));

  render() {
    return this.props.children({
      on: this.state.on,
      toggle: this.toggle
    });
  }
}
#+END_SRC

#+BEGIN_EXPORT html
<script src="https://gist.github.com/ksaxberg/e7ebfcdae62e2b796a56909578072236.js"></script>
#+END_EXPORT

**** What exactly do Render Props do for you?
- Share *functionality* between components
  - The component parts that were _boilerplate_ before can now be re-used!
  - Ever had a component that loads data on mounting, reloads on specific props changes?
  - Maybe it also has a loading state?
  - Stay tuned for some examples of how to use these concepts to re-use code to address these problems!
- Represent a way of utilizing [[https://medium.com/byteconf/render-props-in-react-6081b6fa3593][depencency injection]] in combining components
  - A ~List~ container could know nothing about how each ~ListItem~ is displayed
  - You can skip the component creation steps required in HoCs, as Render Props are defined at their usage.
- But make sure you know [[https://blog.kentcdodds.com/when-to-not-use-render-props-5397bbeff746][why you are using a Render Prop]]

