index.html
<div id="outline-container-orgc3a67f0" class="outline-5">
<h5 id="orgc3a67f0">It loads data. It might send it to view components. It hooks into the lifecycle methods to get the job done</h5>
<div class="outline-text-5" id="text-orgc3a67f0">
<script src="https://gist.github.com/ksaxberg/f8f73aaafa003c6991355e8a5eb59ee2.js"></script>
</div>
</div>
</div>

<div id="outline-container-org131bcc5" class="outline-4">
<h4 id="org131bcc5">Higher Order Component</h4>
<div class="outline-text-4" id="text-org131bcc5">
</div>
<div id="outline-container-orgf3165bb" class="outline-5">
<h5 id="orgf3165bb">Provides additional functionality to the component(s) that are wrapped</h5>
</div>
<div id="outline-container-org51e5f38" class="outline-5">
<h5 id="org51e5f38">Structure: <code>const HoC = config =&gt; BaseComponent =&gt; EnhancedComponent</code></h5>
<div class="outline-text-5" id="text-org51e5f38">
<script src="https://gist.github.com/ksaxberg/9094c3004bf5d619ca0f1d75440d5e9c.js"></script>
</div>
</div>

<div id="outline-container-org1109e77" class="outline-5">
<h5 id="org1109e77">Separating logic from containers can help improve your code</h5>
<div class="outline-text-5" id="text-org1109e77">
<ul class="org-ul">
<li>Containers can worry less about its data loading, management, or connecting to application state management when that functionality is added via an HoC.</li>
<li>Enables you to share functionality between components, as the HoCs exist independent of the components they are applied to.</li>
<li>Can make using components more difficult, as you need to look at the <code>connect</code> function to see what props are being passed by Redux and what props are required to be given to the component.</li>
<li>Adds some visual complexity, as now your app has logic being added to compoennts by a function call, which doesn't look very "jsx"-y. You need to hunt down bugs tracking both through layers of JSX and layers of HoCs.</li>
</ul>
</div>
</div>

<div id="outline-container-org7ad963e" class="outline-5">
<h5 id="org7ad963e">The React team has certain suggestions about how to implement HoCs</h5>
<div class="outline-text-5" id="text-org7ad963e">
<ul class="org-ul">
<li>Don't <a href="https://reactjs.org/docs/higher-order-components.html#dont-mutate-the-original-component-use-composition">modify the functions of the wrapped component</a></li>
<li>HoCs should support <a href="https://reactjs.org/docs/higher-order-components.html#convention-pass-unrelated-props-through-to-the-wrapped-component">passthrough of unrelated props</a></li>
<li>Use the <a href="https://reactjs.org/docs/higher-order-components.html#convention-maximizing-composability">HoC thunk pattern to support composition</a> , which just means you have the parenthesis <code>connect(config)(Component)</code> instead of <code>connect(config, Component)</code>
<ul class="org-ul">
<li>This allows for clear distinction of the component and argmuments when applying multiple HoCs</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org5ef1bbb" class="outline-5">
<h5 id="org5ef1bbb">Additional Resources</h5>
<div class="outline-text-5" id="text-org5ef1bbb">
<ul class="org-ul">
<li><a href="https://reactjs.org/docs/higher-order-components.html">Higher Order Components</a> in the React Documentation</li>
<li>An <a href="https://www.robinwieruch.de/gentle-introduction-higher-order-components/">introduction to HoCs</a></li>
<li>A tutorial on HoCs <a href="https://levelup.gitconnected.com/understanding-react-higher-order-components-by-example-95e8c47c8006">by example</a></li>
<li>The self-purported <a href="https://medium.freecodecamp.org/higher-order-components-the-ultimate-guide-b453a68bb851">Ultimate Guide to HoCs</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org0009e10" class="outline-4">
<h4 id="org0009e10">Render Props</h4>
<div class="outline-text-4" id="text-org0009e10">
</div>
<div id="outline-container-orgb07f02c" class="outline-5">
<h5 id="orgb07f02c">Share functionality between components</h5>
<div class="outline-text-5" id="text-orgb07f02c">
<p>
Here we have a Toggle Render Prop which allows us to share the state of 'on' and a functin to modify that state. Anywhere we need that functionality we can use this Toggle, meaning that we can re-use this state logic!
</p>

<script src="https://gist.github.com/ksaxberg/e7ebfcdae62e2b796a56909578072236.js"></script>
</div>
</div>

<div id="outline-container-org7f769ea" class="outline-5">
<h5 id="org7f769ea">What exactly do Render Props do for you?</h5>
<div class="outline-text-5" id="text-org7f769ea">
<ul class="org-ul">
<li>Share <b>functionality</b> between components
<ul class="org-ul">
<li>The component parts that were <span class="underline">boilerplate</span> before can now be re-used!</li>
<li>Ever had a component that loads data on mounting, reloads on specific props changes?</li>
<li>Maybe it also has a loading state?</li>
<li>Stay tuned for some examples of how to use these concepts to re-use code to address these problems!</li>
</ul></li>
<li>Represent a way of utilizing <a href="https://medium.com/byteconf/render-props-in-react-6081b6fa3593">depencency injection</a> in combining components
<ul class="org-ul">
<li>A <code>List</code> container could know nothing about how each <code>ListItem</code> is displayed</li>
<li>You can skip the component creation steps required in HoCs, as Render Props are defined at their usage.</li>
</ul></li>
<li>But make sure you know <a href="https://blog.kentcdodds.com/when-to-not-use-render-props-5397bbeff746">why you are using a Render Prop</a></li>
</ul>
</div>
</div>
