cool-react-things.org
**** Some things to note

React does not assign meaning to passing a function as ~children~ (a function is not a React.Node type). This is awesome! It means that we can co-opt that usage of children for Render Props.
Instead of defining a prop ~render~ or ~component~ being how the function is passed, you can instead pass the function in as the ~children~ prop.
This keeps code that uses Render Props clean and expressive, as you'll see later on. The React Team themselves have
embraced this paradign in the [[https://reactjs.org/docs/context.html][React Context API]], which uses Render Props to provide an easy interface to avoid 
passing props through multiple layers of components (commonly known as [[https://itnext.io/compound-components-with-react-v16-3-6679c752bd56][prop drilling]]).

Render Props and Higher Order Components ultimately achieve the same thing in different ways. Higher Order Components add functionality to the component but can obscure it behind exports. You'll see this with Redux when we export the connected component, ~export default connect(getCurrentUser)(Header)~. This can reduce reusability and make testing more difficult, as you either mock the HoC or export both the unconnected and connected versions of the component.

Render Props have drawbacks as well, as they define added functionality in-line, which means adding some complexity to the jsx portions. This is located next to the usage, so you have the choice of where you will look to track down bugs. With HoCs, you'll be looking for the definitions of wrapped components to see what is added. With Render Props, you'll be looking in-line in the jsx.

Unrelated, [[https://medium.com/@pshrmn/dont-call-it-a-render-prop-810b80b9c5c5][some people]] are mad about the name Render Prop, but 'function as a child' is not a great
alternative name. There are [[https://americanexpress.io/faccs-are-an-antipattern/][concerns]] about how having ~children~ be a renderable component does not follow good
naming conventions, as ~return this.props.children()~ does not make a lot of sense from how things are named. If
you agree, you could consider renaming the children prop. This does create a class as jsx is being used, so only
do this if you *really* disagree with calling children as a function.

#+BEGIN_SRC js -n :exports (when (eq org-export-current-backend 'html) "none")
// ... Pretend we're in a class
render() {
  const { children: View } = this.props;
  return <View {...this.state} />
}
#+END_SRC

#+BEGIN_EXPORT html
<script src="https://gist.github.com/ksaxberg/92ebf76634ccbd36cb39b193c526c25c.js"></script>
#+END_EXPORT

**** Additional Resources
- [[https://hackernoon.com/do-more-with-less-using-render-props-de5bcdfbe74c][Introduction to Render Props]] and why they are useful
- [[https://reactjs.org/docs/render-props.html][Render Props]] in the React documentation

** How Can We Leverage These?
*** Let's check out some useful pre-made Render Props from React-Powerplug
**** [[https://github.com/renatorib/react-powerplug/blob/master/docs/components/Hover.md][Hover]]
Lets you easily use the hover state on the component.

#+BEGIN_EXPORT html
<script src="https://gist.github.com/ksaxberg/818e3be527a51dec06e582443618eea0.js"></script>
#+END_EXPORT
**** [[https://github.com/renatorib/react-powerplug/blob/master/docs/components/Value.md][Value]]
Store whatever value you want, no need to define state! Oh yea, this Render Prop takes in an ~onChange~ callback,
so you can keep track of what's going on. Ever wanted input text to control the text of another component? Well then maybe this the tool for you!

#+BEGIN_EXPORT html
<script src="https://gist.github.com/ksaxberg/49bf82cba73efc4a4e2a011a8b7c7676.js"></script>
#+END_EXPORT
**** [[https://github.com/renatorib/react-powerplug/blob/master/docs/components/List.md][List]]
Ever wanted an easy way to manipulate a list that's stored in state? Well here's an abstracted way to do that!
List also takes a ~onChange~ callback, meaning you can keep your code squeeky clean and still manipulate that list.

#+BEGIN_EXPORT html
<script src="https://gist.github.com/ksaxberg/13ff5d09c1da5ebeeba7789bfc5a7566.js"></script>
#+END_EXPORT

**** [[https://github.com/renatorib/react-powerplug/blob/master/docs/components/State.md][State]]
For when you want to throw the kitchen sink at your problem. If you wanted state... just write a class. But
React-Powerplug won't judge you if you use this.

#+BEGIN_EXPORT html
<script src="https://gist.github.com/ksaxberg/734cce3fc9ffa76ab4dfad5871b50847.js"></script>
#+END_EXPORT

*** Use Case: Using an Accordion
Sometimes you have a controlled component that you'd rather were uncontrolled, and a handy Render Prop could give the functionality you need in-line.

Defining your own state? Who needs it! We've got Render Props to share the logic, letting us code even faster.
#+BEGIN_SRC js -n :exports (when (eq org-export-current-backend 'html) "none")
import * as React from 'react';

import Accordion from './Accordion';
import Toggle from './Toggle';

const Description = ({onSubmit}) => (
  <div className="-space-v-8">
    <div className="-blue-grey-40">Add your details below</div>
    <Toggle>
      {({on, toggle}) => (
        <Accordion
          state={on ? 'selected' : ''}
          onChange={toggle}  
        >
          <form onSubmit={onSubmit}>
            <input name="details" type="text" />
            <button type="submit">Submit</button>
          </form>
        </Accordion>
      )}
    </Toggle>
  </div>
);
#+END_SRC

#+BEGIN_EXPORT html
<script src="https://gist.github.com/ksaxberg/283b1cf53d9daa444486019e6535c94e.js"></script>
#+END_EXPORT


*** Data Loading
    
**** Wouldn't it be nice if there were some sort of ~Loader~ component?
Something that handled loading data on mounting, loading when relevant props change, setting a loading state, and handling errors? Something that could be used like this:
#+BEGIN_SRC js -n :exports (when (eq org-export-current-backend 'html) "none")
function HandyHeader = ({userId}) => (
  <Loader args={[userId]} load={methodService.run.bind(null, 'userService.grabSomething')}>
    {({data, errors, loading}) => {
      if (loading) {
        return <Loading />;
      }
      if (errors) {
        return <div>Whoops: {errors}</div>;
      }
      return (
        <div>
          <Label>Heres that user specific data you asked for</Label>
          <DataVisualizer data={data} />
        </div>
      );
    }}
  </Loader>
);

const HoCHeader = loader({method: 'userService.grabSomething'})(Header);

const Page = ({userId}) => (
  <div>
    <HoCHeader args={userId} /> // Header is responsible for knowing what props the HoC gives it.
    <Body />
  </div>
);
#+END_SRC

#+BEGIN_EXPORT html
<script src="https://gist.github.com/ksaxberg/38454d47dc01f0ce0a21d107a07884b4.js"></script>
#+END_EXPORT
**** Let's look at an HoC implementation of Loader first
The HoC has a pre-determined target for what will be modified by the values

#+BEGIN_SRC js -n :exports (when (eq org-export-current-backend 'html) "none")
import { hasArrayChanged } from 'array-utils';

class loader = config => Component =>
  class LoaderHoC extends React.Component {
    state = {
      loading: false,
      errors: null,
      data: null,
    };

    componentDidMount() {
      this.loadData();
    }

    componentDidUpdate(prevProps) {
      if (hasArrayChanged(this.props.args, prevProps.args)) {
        this.loadData();
      }
    }


    loadData = async () => {
      this.setState({loading: true});
      try {
        const data = await this.props.load(...this.props.args);
        const this.setState({ data, loading: false, errors: null});
      } catch (err: *) {
        this.setState({data: null, loading: false, errors: err});
      } 
    };

    render() {
      const {args, ...passThrough} = this.props;
      return <Component {...passThrough} {...this.state} />
    }
  }
#+END_SRC

#+BEGIN_EXPORT html
<script src="https://gist.github.com/ksaxberg/7f702f99b72ffcb3abec8c610229e36e.js"></script>
#+END_EXPORT

