index.html

<div id="outline-container-org2d8e4fd" class="outline-5">
<h5 id="org2d8e4fd">Some things to note</h5>
<div class="outline-text-5" id="text-org2d8e4fd">
<p>
React does not assign meaning to passing a function as <code>children</code> (a function is not a React.Node type). This is awesome! It means that we can co-opt that usage of children for Render Props.
Instead of defining a prop <code>render</code> or <code>component</code> being how the function is passed, you can instead pass the function in as the <code>children</code> prop.
This keeps code that uses Render Props clean and expressive, as you'll see later on. The React Team themselves have
embraced this paradign in the <a href="https://reactjs.org/docs/context.html">React Context API</a>, which uses Render Props to provide an easy interface to avoid 
passing props through multiple layers of components (commonly known as <a href="https://itnext.io/compound-components-with-react-v16-3-6679c752bd56">prop drilling</a>).
</p>

<p>
Render Props and Higher Order Components ultimately achieve the same thing in different ways. Higher Order Components add functionality to the component but can obscure it behind exports. You'll see this with Redux when we export the connected component, <code>export default connect(getCurrentUser)(Header)</code>. This can reduce reusability and make testing more difficult, as you either mock the HoC or export both the unconnected and connected versions of the component.
</p>

<p>
Render Props have drawbacks as well, as they define added functionality in-line, which means adding some complexity to the jsx portions. This is located next to the usage, so you have the choice of where you will look to track down bugs. With HoCs, you'll be looking for the definitions of wrapped components to see what is added. With Render Props, you'll be looking in-line in the jsx.
</p>

<p>
Unrelated, <a href="https://medium.com/@pshrmn/dont-call-it-a-render-prop-810b80b9c5c5">some people</a> are mad about the name Render Prop, but 'function as a child' is not a great
alternative name. There are <a href="https://americanexpress.io/faccs-are-an-antipattern/">concerns</a> about how having <code>children</code> be a renderable component does not follow good
naming conventions, as <code>return this.props.children()</code> does not make a lot of sense from how things are named. If
you agree, you could consider renaming the children prop. This does create a class as jsx is being used, so only
do this if you <b>really</b> disagree with calling children as a function.
</p>

<script src="https://gist.github.com/ksaxberg/92ebf76634ccbd36cb39b193c526c25c.js"></script>
</div>
</div>

<div id="outline-container-orged55e4b" class="outline-5">
<h5 id="orged55e4b">Additional Resources</h5>
<div class="outline-text-5" id="text-orged55e4b">
<ul class="org-ul">
<li><a href="https://hackernoon.com/do-more-with-less-using-render-props-de5bcdfbe74c">Introduction to Render Props</a> and why they are useful</li>
<li><a href="https://reactjs.org/docs/render-props.html">Render Props</a> in the React documentation</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org738fa61" class="outline-3">
<h3 id="org738fa61">How Can We Leverage These?</h3>
<div class="outline-text-3" id="text-org738fa61">
</div>
<div id="outline-container-org660da46" class="outline-4">
<h4 id="org660da46">Let's check out some useful pre-made Render Props from React-Powerplug</h4>
<div class="outline-text-4" id="text-org660da46">
</div>
<div id="outline-container-orgd54aae8" class="outline-5">
<h5 id="orgd54aae8"><a href="https://github.com/renatorib/react-powerplug/blob/master/docs/components/Hover.md">Hover</a></h5>
<div class="outline-text-5" id="text-orgd54aae8">
<p>
Lets you easily use the hover state on the component.
</p>

<script src="https://gist.github.com/ksaxberg/818e3be527a51dec06e582443618eea0.js"></script>
</div>
</div>
<div id="outline-container-orgaca1666" class="outline-5">
<h5 id="orgaca1666"><a href="https://github.com/renatorib/react-powerplug/blob/master/docs/components/Value.md">Value</a></h5>
<div class="outline-text-5" id="text-orgaca1666">
<p>
Store whatever value you want, no need to define state! Oh yea, this Render Prop takes in an <code>onChange</code> callback,
so you can keep track of what's going on. Ever wanted input text to control the text of another component? Well then maybe this the tool for you!
</p>

<script src="https://gist.github.com/ksaxberg/49bf82cba73efc4a4e2a011a8b7c7676.js"></script>
</div>
</div>
<div id="outline-container-org2bd21e0" class="outline-5">
<h5 id="org2bd21e0"><a href="https://github.com/renatorib/react-powerplug/blob/master/docs/components/List.md">List</a></h5>
<div class="outline-text-5" id="text-org2bd21e0">
<p>
Ever wanted an easy way to manipulate a list that's stored in state? Well here's an abstracted way to do that!
List also takes a <code>onChange</code> callback, meaning you can keep your code squeeky clean and still manipulate that list.
</p>

<script src="https://gist.github.com/ksaxberg/13ff5d09c1da5ebeeba7789bfc5a7566.js"></script>
</div>
</div>

<div id="outline-container-org4db0554" class="outline-5">
<h5 id="org4db0554"><a href="https://github.com/renatorib/react-powerplug/blob/master/docs/components/State.md">State</a></h5>
<div class="outline-text-5" id="text-org4db0554">
<p>
For when you want to throw the kitchen sink at your problem. If you wanted state&#x2026; just write a class. But
React-Powerplug won't judge you if you use this.
</p>

<script src="https://gist.github.com/ksaxberg/734cce3fc9ffa76ab4dfad5871b50847.js"></script>
</div>
</div>
</div>

<div id="outline-container-org9da4d78" class="outline-4">
<h4 id="org9da4d78">Use Case: Using an Accordion</h4>
<div class="outline-text-4" id="text-org9da4d78">
<p>
Sometimes you have a controlled component that you'd rather were uncontrolled, and a handy Render Prop could give the functionality you need in-line.
</p>

<p>
Defining your own state? Who needs it! We've got Render Props to share the logic, letting us code even faster.
</p>
<script src="https://gist.github.com/ksaxberg/283b1cf53d9daa444486019e6535c94e.js"></script>
</div>
</div>


<div id="outline-container-orgdeeaa8a" class="outline-4">
<h4 id="orgdeeaa8a">Data Loading</h4>
<div class="outline-text-4" id="text-orgdeeaa8a">
</div>
<div id="outline-container-org7578e9e" class="outline-5">
<h5 id="org7578e9e">Wouldn't it be nice if there were some sort of <code>Loader</code> component?</h5>
<div class="outline-text-5" id="text-org7578e9e">
<p>
Something that handled loading data on mounting, loading when relevant props change, setting a loading state, and handling errors? Something that could be used like this:
</p>
<script src="https://gist.github.com/ksaxberg/38454d47dc01f0ce0a21d107a07884b4.js"></script>
</div>
</div>
<div id="outline-container-orge11b685" class="outline-5">
<h5 id="orge11b685">Let's look at an HoC implementation of Loader first</h5>
<div class="outline-text-5" id="text-orge11b685">
<p>
The HoC has a pre-determined target for what will be modified by the values
</p>

<script src="https://gist.github.com/ksaxberg/7f702f99b72ffcb3abec8c610229e36e.js"></script>
</div>
</div>
