cool-react-things.org
**** And here's a  Render Props version of Loader
Render Props allows you to stay flexible and have an indeterminate target, ~children~. Looks very similar in implementation to the HoC, as they both provide ways to share logic!

#+BEGIN_SRC js -n :exports (when (eq org-export-current-backend 'html) "none")
import { hasArrayChanged } from 'array-utils';

type RenderPropArgs<T> = {loading: boolean, data: T, errors: *};

type Props<G, T> = {args: G, load: (...args: G) => Promise<T>, children: React.ComponentType<RenderPropArgs<T>>};

type State<T> = {
  data: T,
  loading: boolean,
  errors: *,
};

class Loader<G, T> extends React.Component<Props<G, T>, State<T>> {
  state = { data: null, errors: null, loading: false };

  componentDidMount() {
    this.loadData();
  }

  componentDidUpdate(prevProps) {
    if (hasArrayChanged(this.props.args, prevProps.args)) {
      this.loadData();
    }
  }

  loadData = async () => {
    this.setState({loading: true});
    try {
      const data = await this.props.load(...this.props.args);
      const this.setState({ data, loading: false, errors: null});
    } catch (err: *) {
      this.setState({data: null, loading: false, errors: err});
    } 
  };

  render() {
    return this.props.children({...this.state});
  }
}
#+END_SRC

#+BEGIN_EXPORT html
<script src="https://gist.github.com/ksaxberg/39edd9b88e76ec9d138bc170c5eefeae.js"></script>
#+END_EXPORT

*** Package to help get ideas about how to use Render Props
**** [[https://github.com/renatorib/react-powerplug][React-Powerplug]]
     It's only 3kb minified! Has many more great Render Props than just the few examples from above.
**** [[https://github.com/jaredpalmer/awesome-react-render-props][List of Render Props Packages]]
     Here is a collection of public packages that leverage Render Props to get the job done. Even if you don't want to write some Render Props yourself, it pays to know the structure as many community packages rely upon it.
* Flexible Layouts with Context API and Render Props
#+BEGIN_COMMENT
--*** Binding callbacks
--There are a few articles about [[https://medium.freecodecamp.org/react-binding-patterns-5-approaches-for-handling-this-92c651b5af56][how to address this.]] The quick answer is to avoid in-line lambdas for performance reason, and to use class properties.
--
--#+BEGIN_SRC js -n :exports (when (eq org-export-current-backend 'html) "none")
--class Component extends React.Component {
--  message = 'Harumph';
--
--  onClick = () => console.log('Hear my message: ', this.message);
--
--  render() {
--    return (
--      <button type="button" onClick={this.onClick}>Click me!</button>
--    );
--  }
--}
--#+END_SRC
--
--#+BEGIN_EXPORT html
--<script src="https://gist.github.com/ksaxberg/fdaa9ba95f1983f7ae8fc749162f368c.js"></script>
--#+END_EXPORT

--*** Gotchas and performance concerns [[https://flexport.engineering/optimizing-react-rendering-part-1-9634469dca02][in an article by Flexport]]
#+END_COMMENT
*** How should component data flow be organized to allow flexibility with [[https://itnext.io/using-advanced-design-patterns-to-create-flexible-and-reusable-react-components-part-3-render-d7517dfe72bc][Render Props]] or with [[https://itnext.io/using-advanced-design-patterns-to-create-flexible-and-reusable-react-components-part-2-react-3c5662b997ab][Context API]]
If the view is always defined statically, there is little flexibility for re-use. At some point you may want to be
able to reuse some code, but shuffle around how the components are being displayed. If the view is defined rigidly, you
would either need to create a whole new view for the component or add flags that allow you to switch between layouts.

But wouldn't it be nice if there were a simple, high level way of re-organizing the view that removes data-flow
concerns? Let's explore ways to utilize React Context and Render Props to add flexibility to your React App
where you may not have thought there was room for any.

*** Wouldn't it be nice to have this kind of flexibility?
One option is to use render props to pass the needed props to the children components, however this would only look nice in simple cases. In complex cases, you'd just be expanding props into every child that you need to render like this, which is just more boilerplate / noise. 

So let's not use render props in our goal-syntax, and instead create something that takes in props at the top level, and allows us to place some view components wherever we want them underneath. This keeps our layout definition nice and clear, and we know that props are 'prop'-erly making it to their final destination.

#+BEGIN_SRC js -n :exports (when (eq org-export-current-backend 'html) "none")
import CardView

const LayoutComplex = (propsForCardView) => (
  <CardView {...propsForCardView}>
    <div className="-layout-h -justify-between">
      <CardView.Avatar />
      <div className="-space-v-16">
        <CardView.Details />
        <CardView.FriendButton />
      </div>
      <CardView.ReportButton />
    </div>
  </CardView>
);

const LayoutFlat = (propsForCardView) => (
  <CardView {...propsForCardView}>
    <div className="-layout-v">
      <CardView.Avatar />
      <CardView.Details />
      <CardView.FriendButton />
      <CardView.ReportButton />
    </div>
  </CardView>
);
#+END_SRC

#+BEGIN_EXPORT html
<script src="https://gist.github.com/ksaxberg/a5de86a3a4acb5167fbfa85d196d936f.js"></script>
#+END_EXPORT

*** Let's see how we can create this kind of component utilizing React's context API to allow us to skip directly passing props.

#+BEGIN_SRC js -n :exports (when (eq org-export-current-backend 'html) "none")
const Context = React.CreateContext();

class CardView extends React.Component {
  Avatar = Avatar;
  ReportButton = ReportButton;
  FriendButton = FriendButton;
  Details = Details;

  render() {
    const {children, ...restProps} = this.props;
    return (
      <Context.Provider value={restProps}>
        {this.props.children}
      </Context.Provider>
    );
  }
}


function ReportButton() {
  return (
    <Context.Consumer>
      {({onReportClick}) => (
        <button type="button" onClick={onReportClick}>Report</button>
      )}
    </Context.Consumer>
  );
}

function Avatar() {
  return (
    <Context.Consumer>
      {({userId}) => (
        <Avatar userId={userId} />
      )}
    </Context.Consumer>
  );
}

/* ... similar looking things for FriendButton and Details ... */

#+END_SRC

#+BEGIN_EXPORT html
<script src="https://gist.github.com/ksaxberg/dcaa0fc00184176382416e0e41ee150c.js"></script>
#+END_EXPORT

*** Word of caution
 The above is a little limited in re-use, as we're using a statically defined Context Provider / Consumer pair. You should be able to define the Consumer/Provider in the constructor, then injecting the consumer as a dependency to those helper components. But that's an uneeded layer of abstraction for the example above. Think of it as an exercise left to the reader!
