index.html

<div id="outline-container-orga0028d4" class="outline-5">
<h5 id="orga0028d4">And here's a  Render Props version of Loader</h5>
<div class="outline-text-5" id="text-orga0028d4">
<p>
Render Props allows you to stay flexible and have an indeterminate target, <code>children</code>. Looks very similar in implementation to the HoC, as they both provide ways to share logic!
</p>

<script src="https://gist.github.com/ksaxberg/39edd9b88e76ec9d138bc170c5eefeae.js"></script>
</div>
</div>
</div>

<div id="outline-container-org205b004" class="outline-4">
<h4 id="org205b004">Package to help get ideas about how to use Render Props</h4>
<div class="outline-text-4" id="text-org205b004">
</div>
<div id="outline-container-org7a5f314" class="outline-5">
<h5 id="org7a5f314"><a href="https://github.com/renatorib/react-powerplug">React-Powerplug</a></h5>
<div class="outline-text-5" id="text-org7a5f314">
<p>
It's only 3kb minified! Has many more great Render Props than just the few examples from above.
</p>
</div>
</div>
<div id="outline-container-org5418cae" class="outline-5">
<h5 id="org5418cae"><a href="https://github.com/jaredpalmer/awesome-react-render-props">List of Render Props Packages</a></h5>
<div class="outline-text-5" id="text-org5418cae">
<p>
Here is a collection of public packages that leverage Render Props to get the job done. Even if you don't want to write some Render Props yourself, it pays to know the structure as many community packages rely upon it.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org6e45c13" class="outline-2">
<h2 id="org6e45c13">Flexible Layouts with Context API and Render Props</h2>
<div class="outline-text-2" id="text-org6e45c13">
</div>
<div id="outline-container-org54ada66" class="outline-4">
<h4 id="org54ada66">How should component data flow be organized to allow flexibility with <a href="https://itnext.io/using-advanced-design-patterns-to-create-flexible-and-reusable-react-components-part-3-render-d7517dfe72bc">Render Props</a> or with <a href="https://itnext.io/using-advanced-design-patterns-to-create-flexible-and-reusable-react-components-part-2-react-3c5662b997ab">Context API</a></h4>
<div class="outline-text-4" id="text-org54ada66">
<p>
If the view is always defined statically, there is little flexibility for re-use. At some point you may want to be
able to reuse some code, but shuffle around how the components are being displayed. If the view is defined rigidly, you
would either need to create a whole new view for the component or add flags that allow you to switch between layouts.
</p>

<p>
But wouldn't it be nice if there were a simple, high level way of re-organizing the view that removes data-flow
concerns? Let's explore ways to utilize React Context and Render Props to add flexibility to your React App
where you may not have thought there was room for any.
</p>
</div>
</div>

<div id="outline-container-org76ecaf8" class="outline-4">
<h4 id="org76ecaf8">Wouldn't it be nice to have this kind of flexibility?</h4>
<div class="outline-text-4" id="text-org76ecaf8">
<p>
One option is to use render props to pass the needed props to the children components, however this would only look nice in simple cases. In complex cases, you'd just be expanding props into every child that you need to render like this, which is just more boilerplate / noise. 
</p>

<p>
So let's not use render props in our goal-syntax, and instead create something that takes in props at the top level, and allows us to place some view components wherever we want them underneath. This keeps our layout definition nice and clear, and we know that props are 'prop'-erly making it to their final destination.
</p>

<script src="https://gist.github.com/ksaxberg/a5de86a3a4acb5167fbfa85d196d936f.js"></script>
</div>
</div>

<div id="outline-container-org9d7f126" class="outline-4">
<h4 id="org9d7f126">Let's see how we can create this kind of component utilizing React's context API to allow us to skip directly passing props.</h4>
<div class="outline-text-4" id="text-org9d7f126">
<script src="https://gist.github.com/ksaxberg/dcaa0fc00184176382416e0e41ee150c.js"></script>
</div>
</div>

<div id="outline-container-org4806410" class="outline-4">
<h4 id="org4806410">Word of caution</h4>
<div class="outline-text-4" id="text-org4806410">
<p>
The above is a little limited in re-use, as we're using a statically defined Context Provider / Consumer pair. You should be able to define the Consumer/Provider in the constructor, then injecting the consumer as a dependency to those helper components. But that's an uneeded layer of abstraction for the example above. Think of it as an exercise left to the reader!
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kyle</p>
<p class="date">Created: 2018-08-21 Tue 19:11</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
